String serverMessageTranslator(String message) {
  if (serverMessagesTranslations.containsKey(message)) {
    return serverMessagesTranslations[message];
  }
  return 'عذراً لقد حدث خطأ ما';
}

Map<String, String> serverMessagesTranslations = {
  'الايميل غير صحيح': 'خطأ في البريد الإلكتروني أو كلمة المرور',
  'كلمه السر خاطئه': 'خطأ في البريد الإلكتروني أو كلمة المرور',
  'تم حظر المستخدم':
      'عزيزي المستخدم حسابك محظور بسبب سوء الاستخدام',
  'السياره غير موجوده': 'عذراً السيارة غير مسجلة في النظام',
  'لايوجد رحلات': 'لا يوجد رحلات',
  'لايوجد حجوزات مسبقا': 'لا يوجد حجوزات',
  'الحجز غير موجود': 'عذراً الحجز غير موجود',
  'ان عدد مقاعد الرحله اكبر من مقاعد السياره..':
      'عذراً عدد مقاعد السيارة أقل من عدد المقاعد المختار',
  'ارجاء اختيار سياره': 'رجاءً اختر سيارة',
  'User not found': 'تعذر الوصول لهذا المستخدم',
  'لايوجد سيارات': 'لا يوجد سيارات',
  'لايوجد ركاب': 'لا يوجد ركاب',
  'الرقم الوطني خاطئ': 'المعلومات غير متطابقة',
  'الاسم الاول خاطئ': 'المعلومات غير متطابقة',
  'الاسم الاخير خاطئ': 'المعلومات غير متطابقة',
  'اسم لاب خاطئ': 'المعلومات غير متطابقة',
  'البريد الإلكتروني مسجل مسبقاً': 'هذا البريد الإلكتروني مسجل مسبقاً',
  'الرقم الوطني مسجل مسبقاً': 'الرقم الوطني مسجل مسبقاً ',
  'خطأ في تسجيل الحساب, الرجاء إعادة المحاولة':
      'خطأ في تسجيل الحساب، رجاءً أعد المحاولة ',
  'لقد تم التقيم بنجاح': 'تم التقييم بنجاح',
  'Connection Time Out': 'تأكد من جودة الاتصال بالإنترنت',
  'No Internet Connection': 'لا يوجد اتصال بالإنترنت',
};
